/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: skuriyam <skuriyam@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/10/16 11:30:27 by skuriyam          #+#    #+#             */
/*   Updated: 2025/10/18 07:42:19 by skuriyam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/*
isprint()
スペースを含む印刷可能な文字をチェックします。

cが表示可能文字の場合：0以外
上記以外：0
*/

#include <stdio.h>

int ft_isprint(int c)
{
	if (c >= 32 && c <= 126)
		return 1;

	return 0;
}

int main(void)
{

	int i = 122;

	printf("%d\n", ft_isprint(i));

}




